[
  {
    "id": 1,
    "fact": "Hell (Jahannam) is a created place prepared by Allah for the disbelievers and wrongdoers.",
    "source": "Qur'an 67:6 — 'Indeed, for those who disbelieve in their Lord is the punishment of Hell, and wretched is the destination.'"
  },
  {
    "id": 2,
    "fact": "Hell has seven distinct gates, each for a specific group of sinners.",
    "source": "Qur'an 15:44 — 'It has seven gates; for every gate is of them a portion designated.'"
  },
  {
    "id": 3,
    "fact": "Each gate leads to a lower, more severe level of punishment.",
    "source": "Tafsir of Ibn Kathir on Qur'an 15:44"
  },
  {
    "id": 4,
    "fact": "The seven named levels mentioned by scholars are: Jahannam, Laza, Hutama, Sa‘ir, Saqar, Jahim, Hawiyah.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah"
  },
  {
    "id": 5,
    "fact": "The bottom of Hell is for the hypocrites (munafiqeen).",
    "source": "Qur'an 4:145 — 'Indeed, the hypocrites will be in the lowest depths of the Fire...'"
  },
  {
    "id": 6,
    "fact": "Hell is vast beyond comprehension.",
    "source": "Hadith — Sahih Muslim 2846: 'The sun and the moon will be rolled up in Hell on the Day of Resurrection.'"
  },
  {
    "id": 7,
    "fact": "Hell will be brought on the Day of Judgment with seventy thousand reins, each pulled by seventy thousand angels.",
    "source": "Sahih Muslim 2842"
  },
  {
    "id": 8,
    "fact": "Hell is black and dark, with no light except the fire itself.",
    "source": "Ibn Rajab al-Hanbali — 'Ahwal al-Qubur' citing earlier reports"
  },
  {
    "id": 9,
    "fact": "The depth of Hell is immense: a stone thrown from its edge would fall for seventy years before reaching the bottom.",
    "source": "Sahih Muslim 2844"
  },
  {
    "id": 10,
    "fact": "Hell has layers (darakaat) — opposite of Paradise's levels (darajaat).",
    "source": "Qur'an 4:145 & scholars like Ibn Taymiyyah"
  },
  {
    "id": 11,
    "fact": "The bridge (as-Sirat) passes over Hell.",
    "source": "Sahih Bukhari 7439"
  },
  {
    "id": 12,
    "fact": "The Hellfire roars with fury and exhalations.",
    "source": "Qur'an 67:7 — 'When they are thrown into it, they hear from it a [terrible] inhaling while it boils up.'"
  },
  {
    "id": 13,
    "fact": "Hell is enclosed and has gates that lock.",
    "source": "Qur'an 90:19-20 — 'But those who disbelieve in Our verses — they are the companions of the left. Upon them is a Fire closed in.'"
  },
  {
    "id": 14,
    "fact": "Its gates are massive and heavy.",
    "source": "Imam al-Qurtubi — 'at-Tadhkira'"
  },
  {
    "id": 15,
    "fact": "Hell is beneath all other creations.",
    "source": "Reported by al-Tabari and Ibn Abi Hatim (tafsir of 83:16-17)"
  },
  {
    "id": 16,
    "fact": "The people of Hell will be gathered and driven towards it in crowds.",
    "source": "Qur'an 39:71"
  },
  {
    "id": 17,
    "fact": "The gates of Hell will be opened only when they arrive.",
    "source": "Qur'an 39:71 — 'Until, when they reach it, its gates are opened…'"
  },
  {
    "id": 18,
    "fact": "Hell has keepers (angels) who stand at its gates.",
    "source": "Qur'an 39:71"
  },
  {
    "id": 19,
    "fact": "The number of Hell's keepers is nineteen.",
    "source": "Qur'an 74:30"
  },
  {
    "id": 20,
    "fact": "Their chief is named Malik.",
    "source": "Qur'an 43:77 — 'And they will call, \"O Malik, let your Lord put an end to us!\"'"
  },
  {
    "id": 21,
    "fact": "Hell has a steep descent; its depth is unimaginable to humans.",
    "source": "Sahih Muslim 2844 — 'If a stone were thrown from the edge of Hell, it would fall for seventy years before reaching its bottom.'"
  },
  {
    "id": 22,
    "fact": "The distance between each of its levels is like the distance between the heavens and the earth.",
    "source": "Tafsir Ibn Kathir on Qur'an 4:145 and Sahih reports"
  },
  {
    "id": 23,
    "fact": "The names of its seven levels indicate increasing severity of torment.",
    "source": "Imam Al-Qurtubi — Al-Tadhkirah fi Ahwal al-Mawta"
  },
  {
    "id": 24,
    "fact": "Its upper parts are less intense than its lower depths, which are reserved for the worst sinners.",
    "source": "Qur'an 4:145 and scholarly consensus (Ibn Taymiyyah, Ibn Kathir)"
  },
  {
    "id": 25,
    "fact": "The gates of Hell will be shut upon its inhabitants and never opened again.",
    "source": "Qur'an 90:20 — 'Upon them will be fire closed over.'"
  },
  {
    "id": 26,
    "fact": "The gates are massive and locked with iron bars.",
    "source": "Tafsir al-Tabari on Qur'an 39:71"
  },
  {
    "id": 27,
    "fact": "Its layers and gates represent justice: each sinner goes to the level fitting their deeds.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah"
  },
  {
    "id": 28,
    "fact": "The inhabitants will be dragged to their assigned gates in groups.",
    "source": "Qur'an 39:71 — 'And those who disbelieved will be driven to Hell in groups...'"
  },
  {
    "id": 29,
    "fact": "When its gates open, it emits a furious roaring sound.",
    "source": "Qur'an 67:7 — 'When they are thrown into it, they hear from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 30,
    "fact": "The Fire itself is conscious and enraged at the disbelievers.",
    "source": "Qur'an 67:8 — 'It almost bursts with rage...'"
  },
  {
    "id": 31,
    "fact": "The flames leap up like giant castles.",
    "source": "Qur'an 77:31-32 — 'Indeed, it throws sparks [as huge] as a fortress, as if they were yellow camels.'"
  },
  {
    "id": 32,
    "fact": "The walls of Hell are extremely high and confining.",
    "source": "Tafsir of Mujahid on Qur'an 90:20 and 18:29"
  },
  {
    "id": 33,
    "fact": "It is a prison with no escape; its structure itself prevents fleeing.",
    "source": "Qur'an 18:29 — 'Indeed, We have prepared for the wrongdoers a fire whose walls will surround them...'"
  },
  {
    "id": 34,
    "fact": "Hell has a covering lid that will be closed over its people.",
    "source": "Qur'an 90:20 — 'Upon them will be fire closed over.'"
  },
  {
    "id": 35,
    "fact": "It has layers one above another, trapping people inside.",
    "source": "Tafsir Ibn Kathir on Qur'an 4:145"
  },
  {
    "id": 36,
    "fact": "Its size is so great that it can contain all disbelievers from the time of Adam until the last human.",
    "source": "Sahih al-Bukhari 4848 — 'Hell will keep saying, \"Are there any more?\" until the Lord places His Foot over it...'"
  },
  {
    "id": 37,
    "fact": "The gates are guarded by fierce angels called Zabaniyah.",
    "source": "Qur'an 96:18 — 'We will call the Zabaniyah.'"
  },
  {
    "id": 38,
    "fact": "There are nineteen chief angels in charge of Hell.",
    "source": "Qur'an 74:30 — 'Over it are nineteen [angels].'"
  },
  {
    "id": 39,
    "fact": "The chief of the angels of Hell is named Malik.",
    "source": "Qur'an 43:77 — 'And they will call, \"O Malik, let your Lord put an end to us!\"'"
  },
  {
    "id": 40,
    "fact": "Hell is completely sealed and escape is impossible.",
    "source": "Qur'an 78:21-23 — 'Indeed, Hell has been lying in wait... for the transgressors... they will remain in it for ages.'"
  },
  {
    "id": 41,
    "fact": "Hell has valleys, mountains, and pits within it.",
    "source": "Hadith — Musnad Ahmad 22939: 'In Hell there is a valley... from whose heat even Hell seeks refuge.'"
  },
  {
    "id": 42,
    "fact": "Each valley is assigned to specific sins, like arrogance or hypocrisy.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah"
  },
  {
    "id": 43,
    "fact": "The terrain of Hell is made of burning coals and molten metal.",
    "source": "Qur'an 18:29 — 'Indeed, We have prepared for the wrongdoers a fire whose walls will surround them. And if they call for relief, they will be relieved with water like molten brass...'"
  },
  {
    "id": 44,
    "fact": "There are chains, collars, and fetters embedded in its structure.",
    "source": "Qur'an 76:4 — 'Indeed, We have prepared for the disbelievers chains and shackles and a blaze.'"
  },
  {
    "id": 45,
    "fact": "Its ground burns and its air suffocates; it is not like any worldly place.",
    "source": "Al-Qurtubi — Al-Tadhkirah; based on multiple Hadith about its heat and choking smoke"
  },
  {
    "id": 46,
    "fact": "Hell contains chains seventy cubits long to bind its dwellers.",
    "source": "Qur'an 69:32 — 'Then in a chain whose length is seventy cubits insert him.'"
  },
  {
    "id": 47,
    "fact": "Its walls are extremely thick to prevent escape or outside influence.",
    "source": "Tafsir al-Qurtubi on Qur'an 18:29"
  },
  {
    "id": 48,
    "fact": "Hell is in a constant state of rage and boiling.",
    "source": "Qur'an 67:7 — 'When they are thrown into it, they hear from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 49,
    "fact": "The fire of Hell was kindled for a thousand years until it became red, then another thousand until it became white, and another thousand until it became black.",
    "source": "Hadith — At-Tirmidhi 2591 (Hasan)"
  },
  {
    "id": 50,
    "fact": "The darkness of Hell is absolute — its fire gives no light, only heat.",
    "source": "Narrations from Ibn Mas'ud (reported by al-Bayhaqi)"
  },
  {
    "id": 51,
    "fact": "Its smoke and flames form canopies that cover the inhabitants.",
    "source": "Qur'an 56:43-44 — 'And shadow of black smoke, neither cool nor beneficial.'"
  },
  {
    "id": 52,
    "fact": "Hell is described as having 'layers' that sinners descend into according to their deeds.",
    "source": "Qur'an 4:145 — 'Indeed, the hypocrites will be in the lowest depths of the Fire...'"
  },
  {
    "id": 53,
    "fact": "The terrain constantly shifts — like moving sand dunes of fire.",
    "source": "Reported in works of Ibn al-Qayyim (Hadi al-Arwah)"
  },
  {
    "id": 54,
    "fact": "Hell itself will be dragged into the Judgment arena as a living entity.",
    "source": "Sahih Muslim 2842 — 'Hell will be brought on that Day having seventy thousand reins...'"
  },
  {
    "id": 55,
    "fact": "The pressure of Hell crushes its dwellers' bones together.",
    "source": "Hadith — al-Tirmidhi 2575 (Hasan)"
  },
  {
    "id": 56,
    "fact": "Its gates open only once, to admit the sinners — then close forever.",
    "source": "Qur'an 39:71-72 — 'Until, when they reach it, its gates are opened... then its gates are closed behind them.'"
  },
  {
    "id": 57,
    "fact": "Hell's gates are so immense that their hinges alone could crush mountains.",
    "source": "Tafsir of Ibn Kathir on Qur'an 39:71"
  },
  {
    "id": 58,
    "fact": "The sound of its opening is like a thunderous roar shaking the heavens.",
    "source": "Qur'an 67:7 — 'They hear from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 59,
    "fact": "The keepers of Hell never show pity or mercy to its inhabitants.",
    "source": "Qur'an 66:6 — 'Over it are angels, harsh and severe; they do not disobey Allah...' "
  },
  {
    "id": 60,
    "fact": "Its lowest pit is called Hawiyah, the most severe and bottomless place.",
    "source": "Qur'an 101:9 — 'His refuge will be the Abyss (al-Hawiyah).'"
  },
  {
    "id": 61,
    "fact": "The floor of Hell burns like a blazing furnace with no place to stand or rest.",
    "source": "Qur'an 18:29 — '...Indeed, We have prepared for the wrongdoers a fire whose walls will surround them...'"
  },
  {
    "id": 62,
    "fact": "The atmosphere is filled with firestorms and scorching winds.",
    "source": "Qur'an 78:21 — 'Indeed, Hell has been lying in wait...'"
  },
  {
    "id": 63,
    "fact": "Hell constantly cries 'Are there any more?' showing its vastness.",
    "source": "Sahih al-Bukhari 4848 and Sahih Muslim 2848"
  },
  {
    "id": 64,
    "fact": "The flames rise as tall as castles, symbolizing its colossal scale.",
    "source": "Qur'an 77:31-32 — 'It throws sparks like palaces...'"
  },
  {
    "id": 65,
    "fact": "There is no exit, doorway, or tunnel out once someone enters.",
    "source": "Qur'an 43:74 — 'Indeed, the criminals will be in the punishment of Hell, abiding eternally.'"
  },
  {
    "id": 66,
    "fact": "Hell itself will speak on the Day of Judgment, testifying against those who are to enter it.",
    "source": "Hadith — Musnad Ahmad 22939 and Qur'an 41:20-21 (limbs testify)"
  },
  {
    "id": 67,
    "fact": "The fire of Hell is seventy times hotter than the fire of this world.",
    "source": "Sahih al-Bukhari 3265 — 'Your fire is one part of seventy parts of the fire of Hell.'"
  },
  {
    "id": 68,
    "fact": "The heat is so intense it melts skin and flesh instantly.",
    "source": "Qur'an 4:56 — 'Every time their skins are roasted through We will replace them with other skins so they may taste the punishment.'"
  },
  {
    "id": 69,
    "fact": "Hellfire burns black and gives no light, only consuming darkness.",
    "source": "Hadith — At-Tirmidhi 2591: 'It became black and dark; it does not give light.'"
  },
  {
    "id": 70,
    "fact": "The fire penetrates the bones and marrow, not just the skin.",
    "source": "Narration from Ibn Mas'ud in Tafsir Ibn Kathir on 4:56"
  },
  {
    "id": 71,
    "fact": "The fire consumes everything but never diminishes.",
    "source": "Qur'an 74:28-29 — 'It lets nothing remain and leaves nothing unburned, blackening the skin.'"
  },
  {
    "id": 72,
    "fact": "It renews the bodies of its inhabitants endlessly so they can continue to feel pain.",
    "source": "Qur'an 4:56"
  },
  {
    "id": 73,
    "fact": "The fire produces noxious fumes that choke and suffocate.",
    "source": "Qur'an 56:43-44 — 'And shadow of black smoke, neither cool nor beneficial.'"
  },
  {
    "id": 74,
    "fact": "The heat causes their brains to boil like seething water.",
    "source": "Qur'an 22:19-20 — '...boiling water will be poured over their heads, melting what is in their bellies and their skins.'"
  },
  {
    "id": 75,
    "fact": "The inhabitants' lips will be burned off, exposing their teeth.",
    "source": "Hadith — Musnad Ahmad 22939: 'Their upper lips will shrink back until they reach the middle of their heads, and their lower lips will hang down to their navels.'"
  },
  {
    "id": 76,
    "fact": "The fire burns through iron and stone as easily as paper.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah, citing early Salaf"
  },
  {
    "id": 77,
    "fact": "The fuel of Hell is disbelievers and stones.",
    "source": "Qur'an 2:24 — '...the Fire whose fuel is men and stones, prepared for the disbelievers.'"
  },
  {
    "id": 78,
    "fact": "The stones are sulfur (brimstone) which burns intensely.",
    "source": "Qur'an 11:82 — '...stones of baked clay, marked from your Lord.'"
  },
  {
    "id": 79,
    "fact": "The fire feeds on itself and grows stronger over time.",
    "source": "Qur'an 104:6-7 — 'It is the fire of Allah, kindled, which leaps up over the hearts.'"
  },
  {
    "id": 80,
    "fact": "It surrounds its inhabitants completely, with flames above, below, and on all sides.",
    "source": "Qur'an 29:55 — '...the Fire will engulf them from above them and from beneath their feet.'"
  },
  {
    "id": 81,
    "fact": "Hellfire will pull the skin and flesh off bones like molten wax.",
    "source": "Qur'an 70:16 — 'It will remove the scalp.'"
  },
  {
    "id": 82,
    "fact": "Even their intestines will burn and spill out from heat.",
    "source": "Sahih Muslim 2989 — 'A man will be punished in the Fire and his intestines will come out.'"
  },
  {
    "id": 83,
    "fact": "The heat will make their bodies swell enormously then burst.",
    "source": "Hadith — Sahih Muslim 2851: 'The molar tooth of a disbeliever will be like Mount Uhud and the thickness of his skin will be forty-two cubits.'"
  },
  {
    "id": 84,
    "fact": "The fire makes their blood and pus boil and ooze from their bodies.",
    "source": "Qur'an 14:17 — 'He will gulp it but will hardly be able to swallow it, and death will come to him from everywhere...' (Tafsir: describing pus and boiling fluid)"
  },
  {
    "id": 85,
    "fact": "Their faces will be scorched and disfigured beyond recognition.",
    "source": "Qur'an 23:104 — 'The Fire will burn their faces, and they will grin with displaced lips.'"
  },
  {
    "id": 86,
    "fact": "The fire produces a terrifying roaring sound as it blazes.",
    "source": "Qur'an 67:7 — 'They hear from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 87,
    "fact": "The sparks of Hell are as large as castles.",
    "source": "Qur'an 77:32 — 'Indeed, it throws sparks as huge as a fortress.'"
  },
  {
    "id": 88,
    "fact": "Its flames leap up as high as the sky.",
    "source": "Qur'an 55:35-37 — 'A flame of fire and smoke will be sent upon you... and when the sky is split apart and becomes rosy like molten oil.'"
  },
  {
    "id": 89,
    "fact": "Hellfire produces no light despite its intensity.",
    "source": "Hadith — At-Tirmidhi 2591: 'It became black and dark; it does not give light.'"
  },
  {
    "id": 90,
    "fact": "The fire pursues and engulfs the people from all sides.",
    "source": "Qur'an 18:29 — '...a fire whose walls will surround them.'"
  },
  {
    "id": 91,
    "fact": "The ground itself is made of fire and molten metal.",
    "source": "Qur'an 22:19-20 — '...and scalding water will be poured upon their heads...'"
  },
  {
    "id": 92,
    "fact": "Hell contains rivers of boiling water and molten copper.",
    "source": "Tafsir al-Qurtubi on Qur'an 22:19-20"
  },
  {
    "id": 93,
    "fact": "Hell's flames emit deafening roaring sounds.",
    "source": "Qur'an 67:7 — 'They hear from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 94,
    "fact": "The heat causes skin to peel off completely and regrow repeatedly.",
    "source": "Qur'an 4:56"
  },
  {
    "id": 95,
    "fact": "The inhabitants will cry out from unbearable heat but will get no relief.",
    "source": "Qur'an 43:77 — 'And they will call, \"O Malik, let your Lord put an end to us!\" He will say, \"Indeed, you will remain.\"'"
  },
  {
    "id": 96,
    "fact": "Hell has seven distinct layers of fire, each more intense than the one above it.",
    "source": "Tafsir Ibn Kathir on Qur'an 15:44 — 'It has seven gates; for every gate is of them a portion designated.'"
  },
  {
    "id": 97,
    "fact": "The food of the people of Hell will be only from the tree of Zaqqum.",
    "source": "Qur'an 37:62-66 — 'Indeed, the tree of Zaqqum is food for the sinful...'"
  },
  {
    "id": 98,
    "fact": "Zaqqum is a tree that grows from the bottom of Hell.",
    "source": "Qur'an 37:64 — 'It is a tree that emerges from the bottom of Hellfire.'"
  },
  {
    "id": 99,
    "fact": "Its fruits resemble the heads of devils in ugliness.",
    "source": "Qur'an 37:65 — 'Its emerging fruit as if it were heads of devils.'"
  },
  {
    "id": 100,
    "fact": "Eating Zaqqum will boil inside their bellies like molten copper.",
    "source": "Qur'an 44:43-46 — 'Indeed, the tree of Zaqqum will be food for the sinful. Like molten copper it will boil in their bellies.'"
  },
  {
    "id": 101,
    "fact": "They will be forced to eat Zaqqum despite loathing it.",
    "source": "Qur'an 37:66 — 'Then indeed, they will eat from it and fill with it their bellies.'"
  },
  {
    "id": 102,
    "fact": "They will have no food except from Dari' — a bitter thorny plant.",
    "source": "Qur'an 88:6 — 'They will have no food except from Dari'.'"
  },
  {
    "id": 103,
    "fact": "Dari' neither nourishes nor satisfies hunger.",
    "source": "Qur'an 88:7 — 'Which neither nourishes nor avails against hunger.'"
  },
  {
    "id": 104,
    "fact": "Their only drink will be scalding water (Hamim).",
    "source": "Qur'an 6:70 — '...and they will be given to drink scalding water which will sever their intestines.'"
  },
  {
    "id": 105,
    "fact": "They will also drink pus (Ghasaq) from the wounds of other people of Hell.",
    "source": "Qur'an 38:57-58 — 'Boiling water and pus to taste...'"
  },
  {
    "id": 106,
    "fact": "They will be made to drink a mixture of boiling water and molten copper.",
    "source": "Qur'an 18:29 — '...if they seek relief, they will be relieved with water like molten brass, which scalds their faces.'"
  },
  {
    "id": 107,
    "fact": "Their drink will tear apart their insides as it is swallowed.",
    "source": "Qur'an 14:16-17 — 'He will be given boiling water to drink; he will gulp it but will hardly be able to swallow it, and death will come to him from everywhere, but he will not die.'"
  },
  {
    "id": 108,
    "fact": "They will be clothed in garments of fire.",
    "source": "Qur'an 22:19 — '...garments of fire will be cut out for them...'"
  },
  {
    "id": 109,
    "fact": "Their clothes will be made from molten copper.",
    "source": "Qur'an 22:20 — '...and scalding water will be poured upon their heads.' (Tafsir: molten copper garments)"
  },
  {
    "id": 110,
    "fact": "Their shoes will be of fire, heating their skulls from below.",
    "source": "Hadith — Sahih Muslim 212 (description of least punished man in Hell having fire under his feet that boils his brain)"
  },
  {
    "id": 111,
    "fact": "Their beds and coverings will also be of fire.",
    "source": "Qur'an 7:41 — 'For them are beds of Hellfire and above them coverings (of fire).' "
  },
  {
    "id": 112,
    "fact": "The fuel of Hell is people and stones.",
    "source": "Qur'an 66:6 — '...whose fuel is people and stones.'"
  },
  {
    "id": 113,
    "fact": "The stones are sulfur stones, intensely flammable.",
    "source": "Tafsir Ibn Kathir on Qur'an 66:6"
  },
  {
    "id": 114,
    "fact": "Even the idols that were worshiped will be fuel in Hell.",
    "source": "Qur'an 21:98 — 'Indeed, you and what you worship besides Allah are firewood for Hell. You will enter it.'"
  },
  {
    "id": 115,
    "fact": "The bodies of its dwellers themselves become fuel for its flames.",
    "source": "Qur'an 3:10 — '...the Fire, whose fuel is men and stones.'"
  },
  {
    "id": 116,
    "fact": "Hell is constantly fed new fuel so its flames never weaken.",
    "source": "Qur'an 2:24 — '...then fear the Fire whose fuel is men and stones, prepared for the disbelievers.'"
  },
  {
    "id": 117,
    "fact": "The drink will cut their intestines into pieces from its heat.",
    "source": "Qur'an 47:15 — '...they will be given boiling water to drink that will sever their intestines.'"
  },
  {
    "id": 118,
    "fact": "They will be dragged to drink while being beaten.",
    "source": "Qur'an 37:67-68 — 'Then indeed, they will return to the blazing fire. Then they will be told to drink scalding water.'"
  },
  {
    "id": 119,
    "fact": "Their throats will choke on the food, yet they must swallow it.",
    "source": "Qur'an 73:13 — 'Food that chokes, and a painful punishment.'"
  },
  {
    "id": 120,
    "fact": "They will beg for cool water but will be denied.",
    "source": "Qur'an 43:75 — 'No relief will there be for them...' "
  },
  {
    "id": 121,
    "fact": "Their clothing will be garments of pitch (tar).",
    "source": "Qur'an 14:50 — 'Their garments will be of pitch, and their faces covered with fire.'"
  },
  {
    "id": 122,
    "fact": "Their clothes will ignite and burn their skin.",
    "source": "Tafsir Ibn Kathir on Qur'an 14:50"
  },
  {
    "id": 123,
    "fact": "Their sandals will be of fire, boiling their brains like a cauldron.",
    "source": "Sahih Muslim 212 — 'The lightest punishment in Hell is a man whose sandals are of fire, causing his brain to boil.'"
  },
  {
    "id": 124,
    "fact": "Chains of fire will be wrapped around their necks.",
    "source": "Qur'an 40:71 — 'When the shackles are around their necks and the chains, they will be dragged.'"
  },
  {
    "id": 125,
    "fact": "They will be dragged through boiling water and then into the fire.",
    "source": "Qur'an 40:72 — 'In boiling water; then in the Fire they will be filled with flame.'"
  },
  {
    "id": 126,
    "fact": "The fuel of Hell is men and stones, showing its massive intensity.",
    "source": "Qur'an 2:24 — '...then fear the Fire whose fuel is men and stones.'"
  },
  {
    "id": 127,
    "fact": "The person who will receive the least punishment among the people of the Fire will be a man who will have two live coals placed under his feet, due to which his brain will boil.",
    "source": "Sahih al-Bukhari 6562, Sahih Muslim 212"
  },
  {
    "id": 128,
    "fact": "Indeed, those who disbelieve in Our verses — We will drive them into a Fire. Every time their skins are roasted through, We will replace them with other skins so they may taste the punishment.",
    "source": "Qur'an 4:56"
  },
  {
    "id": 129,
    "fact": "And they will be given to drink scalding water that will sever their intestines.",
    "source": "Qur'an 47:15"
  },
  {
    "id": 130,
    "fact": "They will have a drink of boiling water and a drink of purulent fluid (ghassaq).",
    "source": "Qur'an 38:57–58, Musnad Ahmad 8439"
  },
  {
    "id": 131,
    "fact": "They will have no food except from a poisonous thorny plant, which neither nourishes nor avails against hunger.",
    "source": "Qur'an 88:6–7"
  },
  {
    "id": 132,
    "fact": "Those who are gathered on their faces to Hell — those are the worst in position.",
    "source": "Qur'an 25:34"
  },
  {
    "id": 133,
    "fact": "Do those who are thrown on their faces into the Fire think that they are better guided than those who walk upright on a straight path?",
    "source": "Qur'an 67:22"
  },
  {
    "id": 134,
    "fact": "If they seek relief, they will be relieved with water like molten brass, which scalds their faces. Wretched is the drink, and evil is the resting place.",
    "source": "Qur'an 18:29"
  },
  {
    "id": 135,
    "fact": "They will cry therein for help: 'Our Lord, remove us; we will do righteousness'... but it will be said: 'Did We not give you lives long enough...?'",
    "source": "Qur'an 35:37"
  },
  {
    "id": 136,
    "fact": "On the Day [some] faces will be white and [some] faces will be black. As for those whose faces turn black: 'Did you disbelieve after your belief? Then taste the punishment for what you used to reject.'",
    "source": "Qur'an 3:106"
  },
  {
    "id": 137,
    "fact": "Those who disbelieve will have cut out for them garments of fire; boiling water will be poured over their heads.",
    "source": "Qur'an 22:19"
  },
  {
    "id": 138,
    "fact": "With it will be melted that within their bellies as well as their skins.",
    "source": "Qur'an 22:20"
  },
  {
    "id": 139,
    "fact": "For them are maces of iron. Every time they want to get out of it from anguish, they will be returned to it and [it will be said], 'Taste the punishment of the Burning Fire.'",
    "source": "Qur'an 22:21-22"
  },
  {
    "id": 140,
    "fact": "And they will call, 'O Malik, let your Lord put an end to us!' He will say, 'Indeed, you will remain.'",
    "source": "Qur'an 43:77"
  },
  {
    "id": 141,
    "fact": "They will be screaming therein, 'Our Lord, remove us; we will do righteousness.' But He will reply, 'Remain in it, and do not speak to Me.'",
    "source": "Qur'an 23:106-108"
  },
  {
    "id": 142,
    "fact": "The Fire will consume everything until it reaches his bones, and when it reaches the bones it will renew the flesh.",
    "source": "Sahih Muslim 212"
  },
  {
    "id": 143,
    "fact": "When the iron collars will be around their necks and the chains; they will be dragged.",
    "source": "Qur'an 40:71"
  },
  {
    "id": 144,
    "fact": "The Fire will burn their faces, and they will therein grin with displaced lips.",
    "source": "Qur'an 23:104"
  },
  {
    "id": 145,
    "fact": "Indeed, We have prepared for the wrongdoers a Fire whose walls will surround them.",
    "source": "Qur'an 18:29"
  },
  {
    "id": 146,
    "fact": "And you will see the criminals that Day bound together in shackles.",
    "source": "Qur'an 14:49"
  },
  {
    "id": 147,
    "fact": "When it sees them from a distant place, they will hear its fury and roaring.",
    "source": "Qur'an 25:12"
  },
  {
    "id": 148,
    "fact": "And Hell will be brought that Day; on that Day man will remember, but how will remembrance benefit him?",
    "source": "Qur'an 89:23, Sahih Muslim 2842"
  },
  {
    "id": 149,
    "fact": "And the disbeliever will say, 'Oh, I wish that I were dust!'",
    "source": "Qur'an 78:40"
  },
  {
    "id": 150,
    "fact": "Indeed, We have prepared chains and shackles and a blazing Fire for the disbelievers.",
    "source": "Qur'an 76:4"
  },
  {
    "id": 151,
    "fact": "Their garments will be of pitch, and the Fire will cover their faces.",
    "source": "Qur'an 14:50"
  },
  {
    "id": 152,
    "fact": "The distance between the shoulders of the disbeliever in Hell will be like the distance of three days' travel for a fast rider.",
    "source": "Sahih al-Bukhari 6551, Sahih Muslim 2852"
  },
  {
    "id": 153,
    "fact": "The molar tooth of the disbeliever will be like Mount Uhud and the thickness of his skin will be seventy cubits.",
    "source": "Sahih Muslim 2851"
  },
  {
    "id": 154,
    "fact": "No! Indeed, from their Lord, that Day, they will be partitioned.",
    "source": "Qur'an 83:15"
  },
  {
    "id": 155,
    "fact": "Indeed, it will be closed down upon them in extended columns.",
    "source": "Qur'an 104:8-9"
  },
  {
    "id": 156,
    "fact": "They will cry: 'O our Lord, bring us out!' ... and they will be given scalding water which will cut up their intestines.",
    "source": "Qur'an 47:15, Qur'an 35:37"
  },
  {
    "id": 157,
    "fact": "Lest a soul should say, 'Oh [how great is] my regret over what I neglected in regard to Allah.'",
    "source": "Qur'an 39:56"
  },
  {
    "id": 158,
    "fact": "Every time a nation enters, it will curse its sister nation.",
    "source": "Qur'an 7:38"
  },
  {
    "id": 159,
    "fact": "Their eyes will be covered with humiliation; they will not be able to see.",
    "source": "Qur'an 68:43"
  },
  {
    "id": 160,
    "fact": "They will not taste therein [any] coolness or drink except scalding water and pus.",
    "source": "Qur'an 78:24-25"
  },
  {
    "id": 161,
    "fact": "And those who disbelieved will be driven to Hell in groups.",
    "source": "Qur'an 39:71"
  },
  {
    "id": 162,
    "fact": "The Fire is Sealed Over Them.",
    "source": "Qur'an 104:8-9"
  }
]