{
  "arguments": [
    {
      "claim": "Neraka is too harsh — Kekal Api is not just.",
      "counter": "Allah’s Keadilan is perfect. Neraka is not arbitrary but the natural outcome of persistent rebellion against truth. Those who knowingly Menolak guidance after clear signs have chosen their Laluan.",
      "reference": "Qur’an 4:40 — 'Indeed, Allah does not wrong [even] as much as an atom’s weight; while if there is a good deed, He multiplies it and gives from Himself a great reward.'",
      "scholar": "Ibn Taymiyyah: 'The Hukuman of Neraka is in proportion to sins, and Kekal Neraka is only for the arrogant deniers who never Bertaubat.'"
    },
    {
      "claim": "Why would a merciful God Mencipta Neraka at all?",
      "counter": "Rahmat does not cancel Keadilan. Allah is both Al-Rahman (Most Merciful) and Al-Adl (Most Just). Without Neraka, tyranny and evil would Pergi unchecked. Syurga without Neraka would make no sense, as choice would Kalah meaning.",
      "reference": "Qur’an 15:49-50 — 'Inform My servants that it is I who am the Forgiving, the Merciful, and that My punishment is the painful punishment.'",
      "scholar": "Al-Ghazali: 'Rahmat without Keadilan is chaos, and Keadilan without Rahmat is cruelty. Allah’s balance is beyond human comprehension.'"
    },
    {
      "claim": "Why Kekal Hukuman for Sementara sins?",
      "counter": "Neraka is Kekal only for those who eternally Menafikan truth until Kematian. For many sinners, Hukuman is Sementara. Moreover, disbelief is not a mere 'Sementara Berlakon' but a conscious, lifelong rejection of Iluhi Rahmat.",
      "reference": "Qur’an 2:39 — 'But those who disbelieve and deny Our signs – they will be companions of the Fire; they will abide therein eternally.'",
      "scholar": "Ibn Qayyim: 'The eternity of Neraka for disbelievers is due to the eternity of their arrogance and denial, not the Sementara nature of actions.'"
    },
    {
      "claim": "A loving God would Memaafkan everyone, even disbelievers.",
      "counter": "Forgiveness requires repentance. A just Menghakimi does not Membebaskan an unrepentant murderer just because he is 'loving.' Allah opens the doors of repentance until the last breath, but those who Menolak Him Menolak His forgiveness.",
      "reference": "Qur’an 39:53 — 'Say, O My servants who have transgressed against themselves: Do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.'",
      "scholar": "Imam Nawawi: 'Allah’s forgiveness encompasses all who turn to Him sincerely, but He does not wrongfully impose forgiveness on those who Mengejek His signs.'"
    },
    {
      "claim": "Why would God care about Kepercayaan? Isn’t good action enough?",
      "counter": "Actions without Iman are like a Rumah without foundation. Kepercayaan gives actions purpose and direction. Otherwise, morality is subjective and collapses when tested. Islam emphasizes both Iman and deeds.",
      "reference": "Qur’an 103:1-3 — 'By time, indeed, mankind is in loss, except for those who have believed and done righteous deeds and advised each other to truth and advised each other to patience.'",
      "scholar": "Imam Al-Shafi‘i: 'If Allah had revealed only Surah Al-Asr, it would suffice to Membuktikan the necessity of Iman and righteous action together.'"
    },
    {
      "claim": "Neraka is Takut-mongering to Mengawal Rakyat.",
      "counter": "Neraka is not manipulation; it is truth revealed. Just as warnings about Penyakit or Api are not Takut tactics but reality checks, so too are Allah’s warnings. The Qur’an uses balance: Harap of Syurga and Takut of Neraka.",
      "reference": "Qur’an 32:21 — 'And We will surely let them taste the nearer punishment short of the greater punishment that perhaps they will repent.'",
      "scholar": "Ibn Kathir: 'Warnings are Rahmat, not tyranny. A warning is only cruelty if it is false — but Allah speaks only truth.'"
    },
    {
      "claim": "Why are some Rakyat born Muslim and others not? That seems unfair.",
      "counter": "Every person is born on the fitrah (natural disposition to recognize God). Everyone is tested according to their circumstances. Islam teaches that those who never truly received the message will not be judged unfairly.",
      "reference": "Qur’an 17:15 — 'And We never punish until We have sent a Messenger.'",
      "scholar": "Ibn Taymiyyah: 'Allah’s Keadilan guarantees that no soul is punished without knowledge. The Ujian is tailored to each individual’s circumstances.'"
    },
    {
      "claim": "If Syurga is Kekal bliss, won’t it become boring?",
      "counter": "Syurga is not static but ever-increasing Kegembiraan. Allah continuously renews blessings, unveils new beauty, and elevates His servants. Human imagination cannot grasp its endless variety.",
      "reference": "Qur’an 50:35 — 'There they will have whatever they wish, and with Us is more.'",
      "scholar": "Ibn Abbas: 'Even the smallest gift in Syurga surpasses the imagination of mankind.'"
    },
    {
      "claim": "Why does God Mengganjar Iman with physical pleasures in Syurga?",
      "counter": "Syurga is not just physical — it is also Rohani: nearness to Allah, Kekal Kedamaian, Kegembiraan beyond description. The physical pleasures are metaphors and incentives for human understanding.",
      "reference": "Qur’an 32:17 — 'No soul knows what has been hidden for them of comfort for eyes as reward for what they used to do.'",
      "scholar": "Imam Ibn Qudamah: 'The greatest delight in Syurga is seeing Allah — everything else is secondary.'"
    },
    {
      "claim": "Why doesn’t Allah just put everyone in Syurga from the Mula?",
      "counter": "Life is a Ujian of sincerity and Membebaskan will. Syurga is a Mengganjar for Usaha, not entitlement. Without accountability, life would be meaningless, and Syurga would Kalah its value.",
      "reference": "Qur’an 67:2 — 'He who created death and life to test you [as to] which of you is best in deed — and He is the Exalted in Might, the Forgiving.'",
      "scholar": "Al-Hasan Al-Basri: 'This world is the Padang; the harvest is in the Hereafter. No one reaps without sowing.'"
    },
    {
      "claim": "Why is Shirk (associating partners with Allah) considered unforgivable?",
      "counter": "Shirk is not just a mistake — it is rejecting the essence of truth: Allah’s Oneness. It is like denying the sun while standing in its Cahaya. Shirk corrupts all good deeds as it breaks the foundation of Kepercayaan.",
      "reference": "Qur’an 4:48 — 'Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills.'",
      "scholar": "Imam Ibn Kathir: 'Shirk is the gravest injustice — giving the right of the Creator to the creation.'"
    },
    {
      "claim": "Why would God threaten Rakyat instead of guiding all directly?",
      "counter": "Allah has sent guidance to every Bangsa through prophets. Threats are warnings, not oppression. Just as parents Memberi amaran children for their safety, Allah warns humanity for ultimate success.",
      "reference": "Qur’an 16:36 — 'And We certainly sent into every nation a messenger, [saying], ‘Worship Allah and avoid Taghut (false gods).’'",
      "scholar": "Imam Tabari: 'Warnings and glad tidings are part of Iluhi wisdom. Without them, humans would become heedless.'"
    }
  ]
}