[
  {
    "id": 1,
    "fact": "Neraka (Jahannam) is a Dicipta place Disediakan by Allah for the disbelievers and wrongdoers.",
    "source": "al-Quran 67:6 — 'Indeed, for those who disbelieve in their Lord is the Hukuman of Neraka, and wretched is the destination.'"
  },
  {
    "id": 2,
    "fact": "Neraka has Tujuh distinct gates, each for a specific group of sinners.",
    "source": "al-Quran 15:44 — 'It has Tujuh gates; for every Pintu gerbang is of them a portion designated.'"
  },
  {
    "id": 3,
    "fact": "Each Pintu gerbang leads to a Menurunkan, more severe Tingkat of Hukuman.",
    "source": "Tafsir of Ibn Kathir on al-Quran 15:44"
  },
  {
    "id": 4,
    "fact": "The Tujuh named levels mentioned by scholars are: Jahannam, Laza, Hutama, Sa‘ir, Saqar, Jahim, Hawiyah.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah"
  },
  {
    "id": 5,
    "fact": "The bottom of Neraka is for the hypocrites (munafiqeen).",
    "source": "al-Quran 4:145 — 'Indeed, the hypocrites will be in the lowest depths of the Api...'"
  },
  {
    "id": 6,
    "fact": "Neraka is vast beyond comprehension.",
    "source": "Hadis — Sahih Muslim 2846: 'The sun and the moon will be rolled up in Neraka on the Hari of Resurrection.'"
  },
  {
    "id": 7,
    "fact": "Neraka will be brought on the Hari of Judgment with seventy thousand reins, each pulled by seventy thousand angels.",
    "source": "Sahih Muslim 2842"
  },
  {
    "id": 8,
    "fact": "Neraka is Hitam and Gelap, with no Cahaya except the Api itself.",
    "source": "Ibn Rajab al-Hanbali — 'Ahwal al-Qubur' citing earlier reports"
  },
  {
    "id": 9,
    "fact": "The depth of Neraka is immense: a stone thrown from its edge would Jatuh for seventy years before reaching the bottom.",
    "source": "Sahih Muslim 2844"
  },
  {
    "id": 10,
    "fact": "Neraka has layers (darakaat) — opposite of Syurga's levels (darajaat).",
    "source": "al-Quran 4:145 & scholars like Ibn Taymiyyah"
  },
  {
    "id": 11,
    "fact": "The Jambatan (as-Sirat) passes over Neraka.",
    "source": "Sahih Bukhari 7439"
  },
  {
    "id": 12,
    "fact": "The Hellfire roars with fury and exhalations.",
    "source": "al-Quran 67:7 — 'When they are thrown into it, they Mendengar from it a [terrible] inhaling while it boils up.'"
  },
  {
    "id": 13,
    "fact": "Neraka is enclosed and has gates that Mengunci.",
    "source": "al-Quran 90:19-20 — 'But those who disbelieve in Our verses — they are the companions of the left. Upon them is a Api closed in.'"
  },
  {
    "id": 14,
    "fact": "Its gates are massive and heavy.",
    "source": "Imam al-Qurtubi — 'at-Tadhkira'"
  },
  {
    "id": 15,
    "fact": "Neraka is Di bawah all other creations.",
    "source": "Reported by al-Tabari and Ibn Abi Hatim (Tafsir of 83:16-17)"
  },
  {
    "id": 16,
    "fact": "The Rakyat of Neraka will be gathered and driven towards it in crowds.",
    "source": "al-Quran 39:71"
  },
  {
    "id": 17,
    "fact": "The gates of Neraka will be opened only when they Tiba.",
    "source": "al-Quran 39:71 — 'Until, when they reach it, its gates are opened…'"
  },
  {
    "id": 18,
    "fact": "Neraka has keepers (angels) who Berdiri at its gates.",
    "source": "al-Quran 39:71"
  },
  {
    "id": 19,
    "fact": "The number of Neraka's keepers is nineteen.",
    "source": "al-Quran 74:30"
  },
  {
    "id": 20,
    "fact": "Their chief is named Malik.",
    "source": "al-Quran 43:77 — 'And they will call, \"O Malik, Membenarkan your Lord put an Menamatkan to us!\"'"
  },
  {
    "id": 21,
    "fact": "Neraka has a steep descent; its depth is unimaginable to humans.",
    "source": "Sahih Muslim 2844 — 'If a stone were thrown from the edge of Neraka, it would Jatuh for seventy years before reaching its bottom.'"
  },
  {
    "id": 22,
    "fact": "The distance between each of its levels is like the distance between the heavens and the earth.",
    "source": "Tafsir Ibn Kathir on al-Quran 4:145 and Sahih reports"
  },
  {
    "id": 23,
    "fact": "The names of its Tujuh levels indicate increasing severity of Azab.",
    "source": "Imam Al-Qurtubi — Al-Tadhkirah fi Ahwal al-Mawta"
  },
  {
    "id": 24,
    "fact": "Its upper parts are less intense than its Menurunkan depths, which are reserved for the worst sinners.",
    "source": "al-Quran 4:145 and scholarly consensus (Ibn Taymiyyah, Ibn Kathir)"
  },
  {
    "id": 25,
    "fact": "The gates of Neraka will be shut upon its inhabitants and never opened again.",
    "source": "al-Quran 90:20 — 'Upon them will be Api closed over.'"
  },
  {
    "id": 26,
    "fact": "The gates are massive and locked with Besi bars.",
    "source": "Tafsir al-Tabari on al-Quran 39:71"
  },
  {
    "id": 27,
    "fact": "Its layers and gates represent Keadilan: each Orang berdosa goes to the Tingkat fitting their deeds.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah"
  },
  {
    "id": 28,
    "fact": "The inhabitants will be dragged to their assigned gates in groups.",
    "source": "al-Quran 39:71 — 'And those who disbelieved will be driven to Neraka in groups...'"
  },
  {
    "id": 29,
    "fact": "When its gates Membuka, it emits a furious roaring Bunyi.",
    "source": "al-Quran 67:7 — 'When they are thrown into it, they Mendengar from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 30,
    "fact": "The Api itself is conscious and enraged at the disbelievers.",
    "source": "al-Quran 67:8 — 'It almost bursts with rage...'"
  },
  {
    "id": 31,
    "fact": "The flames leap up like giant castles.",
    "source": "al-Quran 77:31-32 — 'Indeed, it throws sparks [as huge] as a fortress, as if they were yellow camels.'"
  },
  {
    "id": 32,
    "fact": "The walls of Neraka are extremely high and confining.",
    "source": "Tafsir of Mujahid on al-Quran 90:20 and 18:29"
  },
  {
    "id": 33,
    "fact": "It is a prison with no Melarikan diri; its Struktur itself prevents fleeing.",
    "source": "al-Quran 18:29 — 'Indeed, We have Disediakan for the wrongdoers a Api whose walls will Mengelilingi them...'"
  },
  {
    "id": 34,
    "fact": "Neraka has a covering lid that will be closed over its Rakyat.",
    "source": "al-Quran 90:20 — 'Upon them will be Api closed over.'"
  },
  {
    "id": 35,
    "fact": "It has layers one Di atas another, trapping Rakyat inside.",
    "source": "Tafsir Ibn Kathir on al-Quran 4:145"
  },
  {
    "id": 36,
    "fact": "Its size is so great that it can Mengandungi all disbelievers from the time of Adam until the last human.",
    "source": "Sahih al-Bukhari 4848 — 'Neraka will Menepati saying, \"Are there any more?\" until the Lord places His Kaki over it...'"
  },
  {
    "id": 37,
    "fact": "The gates are guarded by fierce angels called Zabaniyah.",
    "source": "al-Quran 96:18 — 'We will call the Zabaniyah.'"
  },
  {
    "id": 38,
    "fact": "There are nineteen chief angels in charge of Neraka.",
    "source": "al-Quran 74:30 — 'Over it are nineteen [angels].'"
  },
  {
    "id": 39,
    "fact": "The chief of the angels of Neraka is named Malik.",
    "source": "al-Quran 43:77 — 'And they will call, \"O Malik, Membenarkan your Lord put an Menamatkan to us!\"'"
  },
  {
    "id": 40,
    "fact": "Neraka is completely sealed and Melarikan diri is impossible.",
    "source": "al-Quran 78:21-23 — 'Indeed, Neraka has been lying in wait... for the transgressors... they will Kekal in it for ages.'"
  },
  {
    "id": 41,
    "fact": "Neraka has valleys, mountains, and pits within it.",
    "source": "Hadis — Musnad Ahmad 22939: 'In Neraka there is a Lembah... from whose heat even Neraka seeks refuge.'"
  },
  {
    "id": 42,
    "fact": "Each Lembah is assigned to specific sins, like arrogance or hypocrisy.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah"
  },
  {
    "id": 43,
    "fact": "The terrain of Neraka is made of burning coals and Melebur metal.",
    "source": "al-Quran 18:29 — 'Indeed, We have Disediakan for the wrongdoers a Api whose walls will Mengelilingi them. And if they call for relief, they will be relieved with Air like Melebur brass...'"
  },
  {
    "id": 44,
    "fact": "There are chains, collars, and fetters embedded in its Struktur.",
    "source": "al-Quran 76:4 — 'Indeed, We have Disediakan for the disbelievers chains and shackles and a blaze.'"
  },
  {
    "id": 45,
    "fact": "Its ground burns and its air suffocates; it is not like any worldly place.",
    "source": "Al-Qurtubi — Al-Tadhkirah; based on multiple Hadis about its heat and choking Asap"
  },
  {
    "id": 46,
    "fact": "Neraka contains chains seventy cubits long to Mengikat its dwellers.",
    "source": "al-Quran 69:32 — 'Then in a Rantai whose length is seventy cubits insert him.'"
  },
  {
    "id": 47,
    "fact": "Its walls are extremely thick to Menghalang Melarikan diri or outside influence.",
    "source": "Tafsir al-Qurtubi on al-Quran 18:29"
  },
  {
    "id": 48,
    "fact": "Neraka is in a constant Negara of rage and boiling.",
    "source": "al-Quran 67:7 — 'When they are thrown into it, they Mendengar from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 49,
    "fact": "The Api of Neraka was kindled for a thousand years until it became red, then another thousand until it became Putih, and another thousand until it became Hitam.",
    "source": "Hadis — At-Tirmidhi 2591 (Hasan)"
  },
  {
    "id": 50,
    "fact": "The darkness of Neraka is absolute — its Api gives no Cahaya, only heat.",
    "source": "Narrations from Ibn Mas'ud (reported by al-Bayhaqi)"
  },
  {
    "id": 51,
    "fact": "Its Asap and flames form canopies that Melindungi the inhabitants.",
    "source": "al-Quran 56:43-44 — 'And shadow of Hitam Asap, neither cool nor beneficial.'"
  },
  {
    "id": 52,
    "fact": "Neraka is described as having 'layers' that sinners descend into according to their deeds.",
    "source": "al-Quran 4:145 — 'Indeed, the hypocrites will be in the lowest depths of the Api...'"
  },
  {
    "id": 53,
    "fact": "The terrain constantly shifts — like moving sand dunes of Api.",
    "source": "Reported in works of Ibn al-Qayyim (Hadi al-Arwah)"
  },
  {
    "id": 54,
    "fact": "Neraka itself will be dragged into the Judgment Arena as a living entity.",
    "source": "Sahih Muslim 2842 — 'Neraka will be brought on that Hari having seventy thousand reins...'"
  },
  {
    "id": 55,
    "fact": "The pressure of Neraka crushes its dwellers' bones together.",
    "source": "Hadis — al-Tirmidhi 2575 (Hasan)"
  },
  {
    "id": 56,
    "fact": "Its gates Membuka only once, to admit the sinners — then Menutup forever.",
    "source": "al-Quran 39:71-72 — 'Until, when they reach it, its gates are opened... then its gates are closed behind them.'"
  },
  {
    "id": 57,
    "fact": "Neraka's gates are so immense that their hinges alone could crush mountains.",
    "source": "Tafsir of Ibn Kathir on al-Quran 39:71"
  },
  {
    "id": 58,
    "fact": "The Bunyi of its opening is like a thunderous Mengaung shaking the heavens.",
    "source": "al-Quran 67:7 — 'They Mendengar from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 59,
    "fact": "The keepers of Neraka never Menunjukkan pity or Rahmat to its inhabitants.",
    "source": "al-Quran 66:6 — 'Over it are angels, harsh and severe; they do not Derhaka Allah...' "
  },
  {
    "id": 60,
    "fact": "Its lowest Lubang is called Hawiyah, the most severe and bottomless place.",
    "source": "al-Quran 101:9 — 'His refuge will be the Abyss (al-Hawiyah).'"
  },
  {
    "id": 61,
    "fact": "The floor of Neraka burns like a blazing furnace with no place to Berdiri or Berehat.",
    "source": "al-Quran 18:29 — '...Indeed, We have Disediakan for the wrongdoers a Api whose walls will Mengelilingi them...'"
  },
  {
    "id": 62,
    "fact": "The atmosphere is filled with firestorms and scorching winds.",
    "source": "al-Quran 78:21 — 'Indeed, Neraka has been lying in wait...'"
  },
  {
    "id": 63,
    "fact": "Neraka constantly cries 'Are there any more?' showing its vastness.",
    "source": "Sahih al-Bukhari 4848 and Sahih Muslim 2848"
  },
  {
    "id": 64,
    "fact": "The flames Naik as tall as castles, symbolizing its colossal scale.",
    "source": "al-Quran 77:31-32 — 'It throws sparks like palaces...'"
  },
  {
    "id": 65,
    "fact": "There is no Keluar, doorway, or Terowong out once someone enters.",
    "source": "al-Quran 43:74 — 'Indeed, the criminals will be in the Hukuman of Neraka, abiding eternally.'"
  },
  {
    "id": 66,
    "fact": "Neraka itself will Bercakap on the Hari of Judgment, testifying against those who are to Masuk it.",
    "source": "Hadis — Musnad Ahmad 22939 and al-Quran 41:20-21 (limbs testify)"
  },
  {
    "id": 67,
    "fact": "The Api of Neraka is seventy times hotter than the Api of this world.",
    "source": "Sahih al-Bukhari 3265 — 'Your Api is one part of seventy parts of the Api of Neraka.'"
  },
  {
    "id": 68,
    "fact": "The heat is so intense it melts Kulit and Daging instantly.",
    "source": "al-Quran 4:56 — 'Every time their skins are roasted through We will Mengganti them with other skins so they may Merasa the Hukuman.'"
  },
  {
    "id": 69,
    "fact": "Hellfire burns Hitam and gives no Cahaya, only consuming darkness.",
    "source": "Hadis — At-Tirmidhi 2591: 'It became Hitam and Gelap; it does not Memberi Cahaya.'"
  },
  {
    "id": 70,
    "fact": "The Api penetrates the bones and marrow, not just the Kulit.",
    "source": "Narration from Ibn Mas'ud in Tafsir Ibn Kathir on 4:56"
  },
  {
    "id": 71,
    "fact": "The Api consumes everything but never diminishes.",
    "source": "al-Quran 74:28-29 — 'It lets nothing Kekal and leaves nothing unburned, blackening the Kulit.'"
  },
  {
    "id": 72,
    "fact": "It renews the bodies of its inhabitants endlessly so they can continue to Merasa Sakit.",
    "source": "al-Quran 4:56"
  },
  {
    "id": 73,
    "fact": "The Api produces noxious fumes that choke and suffocate.",
    "source": "al-Quran 56:43-44 — 'And shadow of Hitam Asap, neither cool nor beneficial.'"
  },
  {
    "id": 74,
    "fact": "The heat causes their brains to boil like seething Air.",
    "source": "al-Quran 22:19-20 — '...boiling Air will be poured over their heads, melting what is in their bellies and their skins.'"
  },
  {
    "id": 75,
    "fact": "The inhabitants' lips will be burned off, exposing their Gigi.",
    "source": "Hadis — Musnad Ahmad 22939: 'Their upper lips will Mengecut back until they reach the middle of their heads, and their Menurunkan lips will hang down to their navels.'"
  },
  {
    "id": 76,
    "fact": "The Api burns through Besi and stone as easily as paper.",
    "source": "Ibn al-Qayyim — Hadi al-Arwah, citing early Salaf"
  },
  {
    "id": 77,
    "fact": "The fuel of Neraka is disbelievers and stones.",
    "source": "al-Quran 2:24 — '...the Api whose fuel is men and stones, Disediakan for the disbelievers.'"
  },
  {
    "id": 78,
    "fact": "The stones are sulfur (brimstone) which burns intensely.",
    "source": "al-Quran 11:82 — '...stones of baked clay, marked from your Lord.'"
  },
  {
    "id": 79,
    "fact": "The Api feeds on itself and grows stronger over time.",
    "source": "al-Quran 104:6-7 — 'It is the Api of Allah, kindled, which leaps up over the hearts.'"
  },
  {
    "id": 80,
    "fact": "It surrounds its inhabitants completely, with flames Di atas, Di bawah, and on all sides.",
    "source": "al-Quran 29:55 — '...the Api will engulf them from Di atas them and from Di bawah their feet.'"
  },
  {
    "id": 81,
    "fact": "Hellfire will Menarik the Kulit and Daging off bones like Melebur wax.",
    "source": "al-Quran 70:16 — 'It will Membuang the scalp.'"
  },
  {
    "id": 82,
    "fact": "Even their intestines will Terbakar and spill out from heat.",
    "source": "Sahih Muslim 2989 — 'A man will be punished in the Api and his intestines will Datang out.'"
  },
  {
    "id": 83,
    "fact": "The heat will make their bodies swell enormously then burst.",
    "source": "Hadis — Sahih Muslim 2851: 'The molar Gigi of a Orang kafir will be like Mount Uhud and the thickness of his Kulit will be forty-two cubits.'"
  },
  {
    "id": 84,
    "fact": "The Api makes their Darah and pus boil and ooze from their bodies.",
    "source": "al-Quran 14:17 — 'He will gulp it but will hardly be able to swallow it, and Kematian will Datang to him from everywhere...' (Tafsir: describing pus and boiling fluid)"
  },
  {
    "id": 85,
    "fact": "Their faces will be scorched and disfigured beyond recognition.",
    "source": "al-Quran 23:104 — 'The Api will Terbakar their faces, and they will grin with displaced lips.'"
  },
  {
    "id": 86,
    "fact": "The Api produces a terrifying roaring Bunyi as it blazes.",
    "source": "al-Quran 67:7 — 'They Mendengar from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 87,
    "fact": "The sparks of Neraka are as large as castles.",
    "source": "al-Quran 77:32 — 'Indeed, it throws sparks as huge as a fortress.'"
  },
  {
    "id": 88,
    "fact": "Its flames leap up as high as the sky.",
    "source": "al-Quran 55:35-37 — 'A Nyalaan of Api and Asap will be sent upon you... and when the sky is Memisah apart and becomes rosy like Melebur Minyak.'"
  },
  {
    "id": 89,
    "fact": "Hellfire produces no Cahaya despite its intensity.",
    "source": "Hadis — At-Tirmidhi 2591: 'It became Hitam and Gelap; it does not Memberi Cahaya.'"
  },
  {
    "id": 90,
    "fact": "The Api pursues and engulfs the Rakyat from all sides.",
    "source": "al-Quran 18:29 — '...a Api whose walls will Mengelilingi them.'"
  },
  {
    "id": 91,
    "fact": "The ground itself is made of Api and Melebur metal.",
    "source": "al-Quran 22:19-20 — '...and scalding Air will be poured upon their heads...'"
  },
  {
    "id": 92,
    "fact": "Neraka contains rivers of boiling Air and Melebur Tembaga.",
    "source": "Tafsir al-Qurtubi on al-Quran 22:19-20"
  },
  {
    "id": 93,
    "fact": "Neraka's flames emit deafening roaring sounds.",
    "source": "al-Quran 67:7 — 'They Mendengar from it a dreadful inhaling while it boils up.'"
  },
  {
    "id": 94,
    "fact": "The heat causes Kulit to peel off completely and regrow repeatedly.",
    "source": "al-Quran 4:56"
  },
  {
    "id": 95,
    "fact": "The inhabitants will Menangis out from unbearable heat but will get no relief.",
    "source": "al-Quran 43:77 — 'And they will call, \"O Malik, Membenarkan your Lord put an Menamatkan to us!\" He will say, \"Indeed, you will Kekal.\"'"
  },
  {
    "id": 96,
    "fact": "Neraka has Tujuh distinct layers of Api, each more intense than the one Di atas it.",
    "source": "Tafsir Ibn Kathir on al-Quran 15:44 — 'It has Tujuh gates; for every Pintu gerbang is of them a portion designated.'"
  },
  {
    "id": 97,
    "fact": "The Makanan of the Rakyat of Neraka will be only from the Pokok of Zaqqum.",
    "source": "al-Quran 37:62-66 — 'Indeed, the Pokok of Zaqqum is Makanan for the sinful...'"
  },
  {
    "id": 98,
    "fact": "Zaqqum is a Pokok that grows from the bottom of Neraka.",
    "source": "al-Quran 37:64 — 'It is a Pokok that emerges from the bottom of Hellfire.'"
  },
  {
    "id": 99,
    "fact": "Its fruits resemble the heads of devils in ugliness.",
    "source": "al-Quran 37:65 — 'Its emerging Buah-buahan as if it were heads of devils.'"
  },
  {
    "id": 100,
    "fact": "Eating Zaqqum will boil inside their bellies like Melebur Tembaga.",
    "source": "al-Quran 44:43-46 — 'Indeed, the Pokok of Zaqqum will be Makanan for the sinful. Like Melebur Tembaga it will boil in their bellies.'"
  },
  {
    "id": 101,
    "fact": "They will be forced to eat Zaqqum despite loathing it.",
    "source": "al-Quran 37:66 — 'Then indeed, they will eat from it and fill with it their bellies.'"
  },
  {
    "id": 102,
    "fact": "They will have no Makanan except from Dari' — a bitter thorny Tumbuhan.",
    "source": "al-Quran 88:6 — 'They will have no Makanan except from Dari'.'"
  },
  {
    "id": 103,
    "fact": "Dari' neither nourishes nor satisfies hunger.",
    "source": "al-Quran 88:7 — 'Which neither nourishes nor avails against hunger.'"
  },
  {
    "id": 104,
    "fact": "Their only Minuman will be scalding Air (Hamim).",
    "source": "al-Quran 6:70 — '...and they will be given to Minuman scalding Air which will sever their intestines.'"
  },
  {
    "id": 105,
    "fact": "They will also Minuman pus (Ghasaq) from the wounds of other Rakyat of Neraka.",
    "source": "al-Quran 38:57-58 — 'Boiling Air and pus to Merasa...'"
  },
  {
    "id": 106,
    "fact": "They will be made to Minuman a mixture of boiling Air and Melebur Tembaga.",
    "source": "al-Quran 18:29 — '...if they Mencari relief, they will be relieved with Air like Melebur brass, which scalds their faces.'"
  },
  {
    "id": 107,
    "fact": "Their Minuman will tear apart their insides as it is swallowed.",
    "source": "al-Quran 14:16-17 — 'He will be given boiling Air to Minuman; he will gulp it but will hardly be able to swallow it, and Kematian will Datang to him from everywhere, but he will not Mati.'"
  },
  {
    "id": 108,
    "fact": "They will be clothed in garments of Api.",
    "source": "al-Quran 22:19 — '...garments of Api will be Luka out for them...'"
  },
  {
    "id": 109,
    "fact": "Their clothes will be made from Melebur Tembaga.",
    "source": "al-Quran 22:20 — '...and scalding Air will be poured upon their heads.' (Tafsir: Melebur Tembaga garments)"
  },
  {
    "id": 110,
    "fact": "Their shoes will be of Api, heating their skulls from Di bawah.",
    "source": "Hadis — Sahih Muslim 212 (description of least punished man in Neraka having Api under his feet that boils his Otak)"
  },
  {
    "id": 111,
    "fact": "Their beds and coverings will also be of Api.",
    "source": "al-Quran 7:41 — 'For them are beds of Hellfire and Di atas them coverings (of Api).' "
  },
  {
    "id": 112,
    "fact": "The fuel of Neraka is Rakyat and stones.",
    "source": "al-Quran 66:6 — '...whose fuel is Rakyat and stones.'"
  },
  {
    "id": 113,
    "fact": "The stones are sulfur stones, intensely flammable.",
    "source": "Tafsir Ibn Kathir on al-Quran 66:6"
  },
  {
    "id": 114,
    "fact": "Even the idols that were worshiped will be fuel in Neraka.",
    "source": "al-Quran 21:98 — 'Indeed, you and what you Beribadah besides Allah are firewood for Neraka. You will Masuk it.'"
  },
  {
    "id": 115,
    "fact": "The bodies of its dwellers themselves become fuel for its flames.",
    "source": "al-Quran 3:10 — '...the Api, whose fuel is men and stones.'"
  },
  {
    "id": 116,
    "fact": "Neraka is constantly fed new fuel so its flames never weaken.",
    "source": "al-Quran 2:24 — '...then Takut the Api whose fuel is men and stones, Disediakan for the disbelievers.'"
  },
  {
    "id": 117,
    "fact": "The Minuman will Luka their intestines into pieces from its heat.",
    "source": "al-Quran 47:15 — '...they will be given boiling Air to Minuman that will sever their intestines.'"
  },
  {
    "id": 118,
    "fact": "They will be dragged to Minuman while being beaten.",
    "source": "al-Quran 37:67-68 — 'Then indeed, they will Kembali to the blazing Api. Then they will be told to Minuman scalding Air.'"
  },
  {
    "id": 119,
    "fact": "Their throats will choke on the Makanan, yet they must swallow it.",
    "source": "al-Quran 73:13 — 'Makanan that chokes, and a painful Hukuman.'"
  },
  {
    "id": 120,
    "fact": "They will Memohon for cool Air but will be denied.",
    "source": "al-Quran 43:75 — 'No relief will there be for them...' "
  },
  {
    "id": 121,
    "fact": "Their Pakaian will be garments of Getah (tar).",
    "source": "al-Quran 14:50 — 'Their garments will be of Getah, and their faces covered with Api.'"
  },
  {
    "id": 122,
    "fact": "Their clothes will ignite and Terbakar their Kulit.",
    "source": "Tafsir Ibn Kathir on al-Quran 14:50"
  },
  {
    "id": 123,
    "fact": "Their sandals will be of Api, boiling their brains like a cauldron.",
    "source": "Sahih Muslim 212 — 'The lightest Hukuman in Neraka is a man whose sandals are of Api, causing his Otak to boil.'"
  },
  {
    "id": 124,
    "fact": "Chains of Api will be wrapped around their necks.",
    "source": "al-Quran 40:71 — 'When the shackles are around their necks and the chains, they will be dragged.'"
  },
  {
    "id": 125,
    "fact": "They will be dragged through boiling Air and then into the Api.",
    "source": "al-Quran 40:72 — 'In boiling Air; then in the Api they will be filled with Nyalaan.'"
  },
  {
    "id": 126,
    "fact": "The fuel of Neraka is men and stones, showing its massive intensity.",
    "source": "al-Quran 2:24 — '...then Takut the Api whose fuel is men and stones.'"
  },
  {
    "id": 127,
    "fact": "The person who will Menerima the least Hukuman among the Rakyat of the Api will be a man who will have two Hidup coals placed under his feet, due to which his Otak will boil.",
    "source": "Sahih al-Bukhari 6562, Sahih Muslim 212"
  },
  {
    "id": 128,
    "fact": "Indeed, those who disbelieve in Our verses — We will drive them into a Api. Every time their skins are roasted through, We will Mengganti them with other skins so they may Merasa the Hukuman.",
    "source": "al-Quran 4:56"
  },
  {
    "id": 129,
    "fact": "And they will be given to Minuman scalding Air that will sever their intestines.",
    "source": "al-Quran 47:15"
  },
  {
    "id": 130,
    "fact": "They will have a Minuman of boiling Air and a Minuman of purulent fluid (ghassaq).",
    "source": "al-Quran 38:57–58, Musnad Ahmad 8439"
  },
  {
    "id": 131,
    "fact": "They will have no Makanan except from a poisonous thorny Tumbuhan, which neither nourishes nor avails against hunger.",
    "source": "al-Quran 88:6–7"
  },
  {
    "id": 132,
    "fact": "Those who are gathered on their faces to Neraka — those are the worst in position.",
    "source": "al-Quran 25:34"
  },
  {
    "id": 133,
    "fact": "Do those who are thrown on their faces into the Api Berfikir that they are better guided than those who Berjalan upright on a straight Laluan?",
    "source": "al-Quran 67:22"
  },
  {
    "id": 134,
    "fact": "If they Mencari relief, they will be relieved with Air like Melebur brass, which scalds their faces. Wretched is the Minuman, and evil is the resting place.",
    "source": "al-Quran 18:29"
  },
  {
    "id": 135,
    "fact": "They will Menangis therein for Membantu: 'Our Lord, Membuang us; we will do righteousness'... but it will be said: 'Did We not Memberi you lives long enough...?'",
    "source": "al-Quran 35:37"
  },
  {
    "id": 136,
    "fact": "On the Hari [some] faces will be Putih and [some] faces will be Hitam. As for those whose faces turn Hitam: 'Did you disbelieve after your Kepercayaan? Then Merasa the Hukuman for what you used to Menolak.'",
    "source": "al-Quran 3:106"
  },
  {
    "id": 137,
    "fact": "Those who disbelieve will have Luka out for them garments of Api; boiling Air will be poured over their heads.",
    "source": "al-Quran 22:19"
  },
  {
    "id": 138,
    "fact": "With it will be melted that within their bellies as well as their skins.",
    "source": "al-Quran 22:20"
  },
  {
    "id": 139,
    "fact": "For them are maces of Besi. Every time they want to get out of it from anguish, they will be returned to it and [it will be said], 'Merasa the Hukuman of the Burning Api.'",
    "source": "al-Quran 22:21-22"
  },
  {
    "id": 140,
    "fact": "And they will call, 'O Malik, Membenarkan your Lord put an Menamatkan to us!' He will say, 'Indeed, you will Kekal.'",
    "source": "al-Quran 43:77"
  },
  {
    "id": 141,
    "fact": "They will be screaming therein, 'Our Lord, Membuang us; we will do righteousness.' But He will Balas, 'Kekal in it, and do not Bercakap to Me.'",
    "source": "al-Quran 23:106-108"
  },
  {
    "id": 142,
    "fact": "The Api will consume everything until it reaches his bones, and when it reaches the bones it will renew the Daging.",
    "source": "Sahih Muslim 212"
  },
  {
    "id": 143,
    "fact": "When the Besi collars will be around their necks and the chains; they will be dragged.",
    "source": "al-Quran 40:71"
  },
  {
    "id": 144,
    "fact": "The Api will Terbakar their faces, and they will therein grin with displaced lips.",
    "source": "al-Quran 23:104"
  },
  {
    "id": 145,
    "fact": "Indeed, We have Disediakan for the wrongdoers a Api whose walls will Mengelilingi them.",
    "source": "al-Quran 18:29"
  },
  {
    "id": 146,
    "fact": "And you will Melihat the criminals that Hari bound together in shackles.",
    "source": "al-Quran 14:49"
  },
  {
    "id": 147,
    "fact": "When it sees them from a distant place, they will Mendengar its fury and roaring.",
    "source": "al-Quran 25:12"
  },
  {
    "id": 148,
    "fact": "And Neraka will be brought that Hari; on that Hari man will remember, but how will remembrance Memanfaatkan him?",
    "source": "al-Quran 89:23, Sahih Muslim 2842"
  },
  {
    "id": 149,
    "fact": "And the Orang kafir will say, 'Oh, I wish that I were Debu!'",
    "source": "al-Quran 78:40"
  },
  {
    "id": 150,
    "fact": "Indeed, We have Disediakan chains and shackles and a blazing Api for the disbelievers.",
    "source": "al-Quran 76:4"
  },
  {
    "id": 151,
    "fact": "Their garments will be of Getah, and the Api will Melindungi their faces.",
    "source": "al-Quran 14:50"
  },
  {
    "id": 152,
    "fact": "The distance between the shoulders of the Orang kafir in Neraka will be like the distance of three days' travel for a Berpuasa rider.",
    "source": "Sahih al-Bukhari 6551, Sahih Muslim 2852"
  },
  {
    "id": 153,
    "fact": "The molar Gigi of the Orang kafir will be like Mount Uhud and the thickness of his Kulit will be seventy cubits.",
    "source": "Sahih Muslim 2851"
  },
  {
    "id": 154,
    "fact": "No! Indeed, from their Lord, that Hari, they will be partitioned.",
    "source": "al-Quran 83:15"
  },
  {
    "id": 155,
    "fact": "Indeed, it will be closed down upon them in extended columns.",
    "source": "al-Quran 104:8-9"
  },
  {
    "id": 156,
    "fact": "They will Menangis: 'O our Lord, Membawa us out!' ... and they will be given scalding Air which will Luka up their intestines.",
    "source": "al-Quran 47:15, al-Quran 35:37"
  },
  {
    "id": 157,
    "fact": "Lest a soul should say, 'Oh [how great is] my Penyesalan over what I neglected in regard to Allah.'",
    "source": "al-Quran 39:56"
  },
  {
    "id": 158,
    "fact": "Every time a Bangsa enters, it will Laknat its Kakak Bangsa.",
    "source": "al-Quran 7:38"
  },
  {
    "id": 159,
    "fact": "Their eyes will be covered with humiliation; they will not be able to Melihat.",
    "source": "al-Quran 68:43"
  },
  {
    "id": 160,
    "fact": "They will not Merasa therein [any] coolness or Minuman except scalding Air and pus.",
    "source": "al-Quran 78:24-25"
  },
  {
    "id": 161,
    "fact": "And those who disbelieved will be driven to Neraka in groups.",
    "source": "al-Quran 39:71"
  },
  {
    "id": 162,
    "fact": "The Api is Sealed Over Them.",
    "source": "al-Quran 104:8-9"
  }
]